Revit 2027 API
FaceSplitter.GetBoundaries Method
 Gets the boundaries.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<CurveLoop> GetBoundaries()
Public Function GetBoundaries As IList(Of CurveLoop)
public:
IList<CurveLoop^>^ GetBoundaries()
member GetBoundaries : unit -> IList<CurveLoop>
Return Value
IList<CurveLoop>
 The face splitter boundaries.
See Also
Reference
FaceSplitter Class
Autodesk.Revit.DB Namespace